Sprint2/Microservices/OperatorManagementService/OperatorWebservice/target/classes/META-INF/wsdl/OperatorManagementService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.9-b14002 svn-revision#14004. -->
<definitions targetNamespace="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService" name="OperatorManagementService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xs:schema version="1.0" targetNamespace="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService" xmlns:xs="http://www.w3.org/2001/XMLSchema">

      <xs:element name="createDiscount" type="tns:createDiscount"/>

      <xs:element name="createDiscountResponse" type="tns:createDiscountResponse"/>

      <xs:element name="createOperator" type="tns:createOperator"/>

      <xs:element name="createOperatorResponse" type="tns:createOperatorResponse"/>

      <xs:element name="createTripCost" type="tns:createTripCost"/>

      <xs:element name="createTripCostResponse" type="tns:createTripCostResponse"/>

      <xs:element name="startService" type="tns:startService"/>

      <xs:element name="startServiceResponse" type="tns:startServiceResponse"/>

      <xs:complexType name="createTripCost">
        <xs:sequence>
          <xs:element name="baseCostString" type="xs:string"/>
          <xs:element name="operatorName" type="xs:string"/>
          <xs:element name="timeStamp" type="xs:string"/>
          <xs:element name="planType" type="xs:string"/>
          <xs:element name="token" type="xs:string"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="createTripCostResponse">
        <xs:sequence>
          <xs:element name="return" type="xs:string" minOccurs="0"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="createDiscount">
        <xs:sequence>
          <xs:element name="operators" type="xs:string" nillable="true" maxOccurs="unbounded"/>
          <xs:element name="discountId" type="xs:string"/>
          <xs:element name="discountName" type="xs:string"/>
          <xs:element name="value" type="xs:string"/>
          <xs:element name="beginAt" type="xs:string"/>
          <xs:element name="endAt" type="xs:string"/>
          <xs:element name="planTypes" type="xs:string" nillable="true" maxOccurs="unbounded"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="createDiscountResponse">
        <xs:sequence>
          <xs:element name="return" type="xs:string" minOccurs="0"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="createOperator">
        <xs:sequence>
          <xs:element name="operator" type="xs:string"/>
          <xs:element name="operatorType" type="xs:string"/>
          <xs:element name="price" type="xs:string"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="createOperatorResponse">
        <xs:sequence>
          <xs:element name="return" type="xs:string" minOccurs="0"/>
        </xs:sequence>
      </xs:complexType>

      <xs:complexType name="startService">
        <xs:sequence/>
      </xs:complexType>

      <xs:complexType name="startServiceResponse">
        <xs:sequence/>
      </xs:complexType>
</xs:schema>
  </types>
  <message name="createOperator">
    <part name="parameters" element="tns:createOperator"/>
  </message>
  <message name="createOperatorResponse">
    <part name="parameters" element="tns:createOperatorResponse"/>
  </message>
  <message name="startService">
    <part name="parameters" element="tns:startService"/>
  </message>
  <message name="startServiceResponse">
    <part name="parameters" element="tns:startServiceResponse"/>
  </message>
  <message name="createTripCost">
    <part name="parameters" element="tns:createTripCost"/>
  </message>
  <message name="createTripCostResponse">
    <part name="parameters" element="tns:createTripCostResponse"/>
  </message>
  <message name="createDiscount">
    <part name="parameters" element="tns:createDiscount"/>
  </message>
  <message name="createDiscountResponse">
    <part name="parameters" element="tns:createDiscountResponse"/>
  </message>
  <portType name="OperatorManagementService">
    <operation name="createOperator">
      <input wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createOperatorRequest" message="tns:createOperator"/>
      <output wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createOperatorResponse" message="tns:createOperatorResponse"/>
    </operation>
    <operation name="startService">
      <input wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/startServiceRequest" message="tns:startService"/>
      <output wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/startServiceResponse" message="tns:startServiceResponse"/>
    </operation>
    <operation name="createTripCost">
      <input wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createTripCostRequest" message="tns:createTripCost"/>
      <output wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createTripCostResponse" message="tns:createTripCostResponse"/>
    </operation>
    <operation name="createDiscount">
      <input wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createDiscountRequest" message="tns:createDiscount"/>
      <output wsam:Action="http://ec2-3-80-233-61.compute-1.amazonaws.com:9997/operatorManagementService/OperatorManagementService/createDiscountResponse" message="tns:createDiscountResponse"/>
    </operation>
  </portType>
  <binding name="OperatorManagementServicePortBinding" type="tns:OperatorManagementService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="createOperator">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="startService">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="createTripCost">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="createDiscount">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="OperatorManagementService">
    <port name="OperatorManagementServicePort" binding="tns:OperatorManagementServicePortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

